Revit 2024 API
AnalyticalMember Class
 Represents a linear element in the structural analytical model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AnalyticalMember : AnalyticalElement
Visual Basic
Public Class AnalyticalMember _
	Inherits AnalyticalElement
Visual C++
public ref class AnalyticalMember : public AnalyticalElement
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalElement
 Autodesk.Revit.DB.Structure.AnalyticalMember
See Also
AnalyticalMember Members
Autodesk.Revit.DB.Structure Namespace